`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 2019/06/18 20:54:36
// Design Name: 
// Module Name: tb_led_water
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////


module tb_led_water(

    );                                           //Verilog仿真测试文件没有输入输出部分

//----------------------------------------------------------------------------------------------------------------------------
reg clk;                                        //定义仿真测试文件的输出变量，这里一般是输出给待测试模块
reg datain;

//----------------------------------------------------------------------------------------------------------------------------
led_water   uut(                                //实例化待仿真测试的文件，led_water为待测试模块，uut为实例化
    .clk(clk),                                  //左边(点右边)为待测试模块的接口，右边(括号内变量)为本测试模块定义的变量
    .datain(datain),
    .dataout(dataout)
);

//----------------------------------------------------------------------------------------------------------------------------
initial begin                                   //此行代码以下为仿真测试激励代码编写部分
    clk <= 0;
    datain <= 0;
end

always #10 clk <= ~clk;
always #100 datain <= ~datain; 
    
endmodule






